externalSolarLoadV5/0.orig/airRegion/IDefault
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      IDefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inLetAir
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    outLetAir
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    yFront
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    yBack
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    groundWall
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    topWall
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    airRegion_to_panel
    {
        type            greyDiffusiveRadiation;
        value           uniform 0;
    }
    
}


// ************************************************************************* //
