externalSolarLoadV5/0.orig/airRegion/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    inLetAir
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    outLetAir
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    yFront
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    yBack
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    groundWall
    {
        type            fixedValue;
        value           uniform 300;
    }
    topWall
    {
        type            inletOutlet;
        value           uniform 300;
        inletValue      uniform 300;
    }
    airRegion_to_panel
    {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        value           uniform 300;
        Tnbr            T;
        kappaMethod     fluidThermo;
        qrNbr           none;
        qr              qr;
        kappa           none;
    }
}


// ************************************************************************* //
