externalSolarLoadV5/0.orig/airRegion/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0.1 0 0 );

boundaryField
{
    inLetAir
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    outLetAir
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    yFront
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    yBack
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    groundWall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    topWall
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
    airRegion_to_panel
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
        phi             phi;
    }
}


// ************************************************************************* //
