externalSolarLoadV5/0.orig/airRegion/k

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    inLetAir
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    outLetAir
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    yFront
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    yBack
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    groundWall
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    topWall
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    airRegion_to_panel
    {
        type            kqRWallFunction;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
}


// ************************************************************************* //
