externalSolarLoadV5/system/panel/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
    }
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            panel_to_air
            {
                type            compressible::turbulentTemperatureRadCoupledMixed;
                Tnbr            T;
                kappaMethod     solidThermo;
                qrNbr           qr;
                qr              none;
                kappa           none;
                thermalInertia  true;
                value           uniform 300;
            }

        }
    }
}


// ************************************************************************* //
